<?php

namespace Database\Seeders;

use App\Models\Department;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $code = config('envAccess.COLLEGE_CODE');
        $array = [];

        switch ($code) {
            case "ETEC":
                $array = ['ئەندازیاری سیستەمی زانیاری', 'ئەندازیاری شارستانی', 'ئەندازیاری رێگاوبان', 'ئەندازیاری میکانیک و وزە'];
                break;
            case "ETHC":
                $array = ['شیکاری نەخۆشیەکان', 'چارەسەری سرووشتی', 'پەلی دەستکرد و پاڵپشتەکان'];
                break;
            case "ETAC":
                $array = ['تەکنیکی کارگێڕیکار', 'تەکنیکی ژمێریاری', 'تەکنیکی میدیا', 'تەکنیکی بازارگەری نێودەولەتی و زمان'];
                break;
            case "ERTC":
                $array = ['ئەندازیاری تەکنەلۆجیای کەرستەو بیناکاری', 'ئەندازیاری تەکنەلۆجیای زانیاری و گەیاندن', 'ئەندازیاری تەکنەلۆجیای ئۆتۆماتیکی پیشەسازی', 'ئەندازیاری تەکنەلۆجیای ئۆتۆمبێل', 'تەکنەلۆجیای وزەی نوێبوەوە', 'تەکنەلۆجیای پتڕۆل', 'درووستکردنی رێگاوبان', 'رووپێوان'];
                break;
            case "ETAI":
                $array = ["تەکنیکی میدیا", "تەکنیکی وەرگێڕان", "کارگێری کار", "کارگێری یاسایی", "ژمێریاری", "سیستەمی زانیارییەکانی کارگێڕی", "کارگێری بازاڕگەری", "کارگێڕی دەزگاکانی گەشتیاری", "زانیارییەکان و کتێبخانە"];
                break;
            case "ETMI":
                $array = ["شیکاری نەخۆشیەکان", "پەرستاری", "دەرمانسازی", "سرکردن", "تیشک", "پشکنینی چاو", "ئافرەتان و لەدایکبوون", "ی. پزیشکی ددان"];
                break;
            case "KOTI":
                $array = ["پەرستاری", "شیکاری نەخۆشیەکان", "ئافرەتان و لەدایکبوون", "تەکنەلۆجیای زانیاری", "کارگێریکار", "تەکنەلۆجیای نەوت - بەرهەمهێنان و پاڵاوتن", "تەکنەلۆجیای نەوت - شیکاری کیمیاوی", "کارگێری دەزگاکانی گەشتیاری", "پەرستاری - تەق تەق", "شیکاری نەخۆشیەکان - تەق تەق"];
                break;
            case "SOTC":
                $array = ["پەرستاری", "شیکاری نەخۆشیەکان", "ئافرەتان و لەدایکبوون", "ژمێریاری", "کارگێریکار", "تەکنەلۆجیای زانیاری"];
                break;
            case "SHTC":
                $array = ['تەکنەلۆجیای زانیاری', 'سیستەمی زانیاری کارگێڕی', 'کارگێڕی کار', 'ڤێرتەرنەری', 'پەرستاری', 'شیکاری نەخۆشیەکان', 'تەلارسازی', 'بیناکاری', 'کارگێڕی دەزگاکانی گەشتیاری', 'کوالێتی خۆراک'];
                break;
            case "KHTI":
                $array = ['تەکنەلۆجیای زانیاری', 'کارگێری یاسایی', 'پاراستنی رووەک', 'بەرهەم هێنانی رووەکی پزیشکی', 'ئاسایشی خۆراک و کۆنترۆلی جۆری'];
                break;
            case "CHTI":
                $array = ['کارگێری کار', 'کارگێری گومرگی', 'تەکنەلۆجیای زانیاری'];
                break;
            case "METI":
                $array = ['پەرستاری', 'کارگێریکار'];
                break;

        }

        foreach ($array as $item) {

            Department::create([
                'name' => $item,
            ]);
        }
    }
}
